{"Concept/Model-Fitting":{"slug":"Concept/Model-Fitting","filePath":"Concept/Model Fitting.md","title":"Model Fitting","links":[],"tags":[],"content":"Some cases are too complex to describle with mathmatical formulas, so we need to analyze data points. Here are the tasks:\n\nFitting a selected model type or types to the data.\nChoosing the best fitted model.\nMaking predicitons.\n\nRelationship Between Model Fitting and Interpolation\nModel Fitting involves finding a mathmatical function that best represents the given data. It doesn’t necessarily pass through all the data points. Interpolation involves finding a function that exactly passes through all the data points.\nSources of Error in the Modeling Process\n\nFormulation error\nFormulation error presents in all the models when certain variables are negligible or simplifed in the assumption.\nTruncation error\nTruncation error occors when numerical methods used to solve mathmatical problems cause inacurated errors.\nRound-off error\nRound-off error happens when infinit digit cannot be represented exactly using finit digits.\nMeasurement error\nMeasurement error is caused by inaccurate data collaction.\n\n3.1 Fitting Models to Data Graphically\nModels need as many data points in the model curve.\nThe spacing of the data points within that interval is also important.\nAccuracy of the data points need to be appraised everytime before fitiing the model.\n\nVisual Model Fitting with the Original Data\nGenerally, when more than two data points exist, some points are not lied on a same line. There will be vertical distances between inaccurate points and the line. We call these vertical distances absolute deviations. For the best-fitiing line, we aim to minimize the sum of these absolute deviations. However, some large absolute deviations will impact the line a lot. A line that minimizes the largest deviation from any point is an alternative.\nTransforming the Data\nSometimes the relationships are complex, thus the graphs are difficult to draw. In order to draw simpler graphs, we can put not only x ot y on the x-axis or y-axis, but also functions or relations about x and y. This need some more mathematical processes but will come up with simpler results, such as straight lines.\n3.2 Analytic Methods of Model Fitting\nChebyshev Approximation Criterion\nChebyshe Approximation Criterion is used to minimize the largest absolute deviation.\nGiven a function y = f(x) and a collection of n data points (x_i, y_i). Minimizes the number\n\\text{Maximum} \n \\quad |y_i - f(x_i)| \\qquad  i = 1,2,...,n\nRedidual is difference between true value and measured value. Note that rediduals can be positive or negative, but absolute deviations are always positive.\n r = x_i - m_i \\qquad r = \\text{Redidual}, \\ x = \\text{True Value}, \\ m = \\text{Measured Value}\nFor every data point, there is a residual r_i . The largest absolute value among all r_i​ is called r, and we aim to minimize r.\nThe r needs to meet:\n|r_i| \\leq r \\quad -r \\leq r_i \\leq r\n|r_i| \\leq r can be expressed by r - r_i \\leq 0 and r + r_i \\geq 0 .\n\\begin{aligned}\nr - (x_i - m_i) \\geq 0 \\quad (r - r_i \\geq 0) \\\\\nr + (x_i - m_i) \\geq 0 \\quad (r + r_i \\geq 0)\n\\end{aligned}\nThe weakness of Chebyshev Approximation Criterion is that it gives more weight to a single point with large deviation.\nMinimizing the Sum of the Absolute Deviations\nGiven a function y = f(x) and a collection of n data points (x_i, y_i). Then we want to minimize\n\\sum_{i=1}^{n} \\lvert y_i - f(x_i) \\rvert\nR_i = |y_i - f(x)|, i = 1, 2, ..., n represent each absolute deviation. We want to minimize by adding together the number R_i .\nLeast Squares Criterion\nGiven a function y = f(x) and a collection of n data points (x_i, y_i). Then we want to minimize\n\\sum_{i=1}^{n}|y_i - f(x_i)|^2\nR_i = |y_i - f(x)|, i = 1, 2, ..., n. Consider R_i are scalar components of a deviation vector\\mathbf{R} = R_1 \\mathbf{i} + R_2 \\mathbf{j} + R_3 \\mathbf{k}. In other word, we want to make vector, \\mathbf R, as short as possible.\n\nThe formula to calculate this deviation vector is\n|\\mathbf R| = \\sqrt{R_1^2 + R_2^2 + R_3^2}\nIn order to minimize |\\mathbf R|, we can minimize |\\mathbf R|^2.\nRelating the Criteria\nCombining Chebyshev Approximation Criterion and Least Squares Criterion.\nThe absolute deciations according to Chebyshev Approximation Criterion are:\nc_i = |y_i - f(x_i)|, \\quad i = 1,2,...,n\nDefine the largest absolute deviations is c_{max}, which we want to minimize.\nThe absolute deciations according to Least Squares Criterion are:\nd_i = |y_i - f(x_i)|, \\quad i = 1,2,...,n\nDefine the largest absolute deviations is d_{max}.\nNote:\nd_{max} \\leq c_{max}\nAccording to the definition of Least Squares Criterion, the sum of d_i is the smallest, so:\nd_1^2 + d_2^2 +...+ d_n^2 \\leq c_1^2 + c_2^2 +...+ c_n^2\nSince c_i &lt; c_{max} , therefore,\nd_1^2 + d_2^2 +...+ d_n^2 \\leq nc_{max}^2\nIsolate c_{max} by following formula:\nc_{max} \\geq \\sqrt\\frac{d_1^2 + d_2^2 +...+ d_n^2}{n}\nFor ease of discussion, define\nD = \\sqrt\\frac{d_1^2 + d_2^2 +...+ d_n^2}{n}\nThus,\nD \\leq c_{max} \\leq d_{max}\n$$If $|D - d_{max}|$ is too large, Chebyshev Approximation Criterion will be better than Least Squares Criterion."},"Concept/Modeling-Change":{"slug":"Concept/Modeling-Change","filePath":"Concept/Modeling Change.md","title":"Modeling Change","links":[],"tags":[],"content":"Introduction\nA mathematical model is an idealization of the real-world phenomenon, which will never be completely accurate. However, it is still a good way to help us understand the world through valuable results and conclusions.\nSimplification\nModels, approximate real-world behavior, simplify reality.\nSimplifying relationship: proportionality\n\nDefinition: Two variables y and x are proportional (to each other) if the ratio is a nonzero constant.\ny = kx We write y ∝ x.\nGeometric meaning:\nThe graph of y versus x is a straight line pass through the origin.\nModeling Change\nModeling change formula:\n change = future value - present value\nModeling Change with Difference Equations\nDefinition: For a sequence of numbers, the nth first difference is the difference between the nth term and the (n+1) th term. A = \\{a_0, a_1, a_2, a_3, \\dots a_n\\}, the nth first difference is:\n\\Delta a_n = a_{n+1} - a_n\nApproximating Change with Difference Equations\nIn many cases, mathematical descriptions of change are not exact. We observe patterns in the data and approximate the change mathematically by using\nchange = \\Delta a_n = some\\ function\\ f\nDiscrete Versus Continuous Change\nSome change takes place in discrete time intervals and the other change happens continuously. Difference equations represents change in discrete time intervals. For some continuous condition, we use difference equation to approximate, which is an example of model simplification.\nSolutions to Dynamical Systems\nDefinition: A dynamical system is a relationship involving time period.\nThe Method of Conjecture\nDefinition: The method of conjecture is a reasoning guess (conjecture) of relationship or formula to a dynamical system based on observed data.\nThe conjectured formula has to be tested and accepted or rejected based on it satisfy the system or not.\nThe formula for the linear dynamical system is\n\nwhere a_0 is a given initial value. It can also be written as\na_{n+1}  = ra_n$$\nFor some special values, if *r* = 0, then the sequence are zero. If r = 1, then $a_{n+1} = a_n$ . If *r* &gt; 1, $a_{n+1}  = ra_n$ . If *r* is negative, the graph oscillates between positive and negative values. If |*r*| &lt; 1, when n approaches to infinity, $a_n$ approaches to zero. \n\nAdding a constant term *b* to the dynamical system formula shown previously. We get $a_{n+1} = ra_n + b$. In this a dynamical system $a_{n+1} = f(a_n)$, if value x satisfy $x = f(x)$, then *x* is called an **equilibrium value** or **fixed point**. \n\nThe formula of the equilibrium value for the dynamical system is$$ a = \\frac b {1 - r}$$where *r* $\\neq$ 1."},"Concept/The-Modeling-Process,-Proportionality,-and-Geometric-Similarity":{"slug":"Concept/The-Modeling-Process,-Proportionality,-and-Geometric-Similarity","filePath":"Concept/The Modeling Process, Proportionality, and Geometric Similarity.md","title":"The Modeling Process, Proportionality, and Geometric Similarity","links":[],"tags":[],"content":"Modeling Procedure\n\nObserve real-world behavior and simplify factors\nConjecture relationships among factors and create rough model\nUse mathmatical analysis to conclude the model\nInterpret mathematical conclusions in terms of the real-world problem\nConclusions pertain only to the model not real-world system because of somplifications. It is possible that the conclusion does not fit the real world system, then we have to refine the model or create a new model.\n\nMathematical Model\nA mathematical model is representation of real-wolrd system or phenomeon.\nModel Types\nExperiments - obsevations are obtained directly\nSimulations - obsevations are obtained indirectly\nProperties of a Model\nFidelity: The degree to which a model precisely represents real-world conditions.\nWe expect greatest fidelity. However, models lose fidelity whenever real-world conditions are simplified.\nCost: The overall cost involved in developing and maintaining the model.\nWe expect the models be the least expensive.\nFlexibility: The capacity to modify the model based on newly collected data.\nConstruction of Models\nSTEP 1: Identify the problem\nWrite problem restatement.\nSTEP 2: Make assumptions\nAssumptions is helpful to simplify problems. You also need to justify your assumptions.\nFirst, you find all the factors and make assumption to simplify their relationships. Second, some factors (or variables) are neglectable. Neglect them will make the problem easier.\nSTEP 3: Create the model\nInterpret what the model shows. Sometimes the model cannot interpret the real-world, this is when we need to go back to Step 1 and Step 2 redefine the problem.\nSTEP 4: Test the model\nFirst, test if the model make common sense. Second, use actual data to test model.\nSTEP 5: Use the model\nOperate model that users can understand.\nSTEP 6: Maintain the model\nAdjust submodules if needed.\nSimilar to scientific method.\nIterative Nature of Model Construction\nRepeate the model construction process to refine the model. This is opposite way to simplification.\nRobust: A model is robust if its conclusions remain valid despite variations in assumptions.\nFragile: A model is fragile if its conclusions depend heavily on precise conditions.\nSensitivity: The degree of change in a model’s conclusions when some conditions change.\nThe greater the conclusions change, the more sensitive the model is.\nModeling Using Proportionality\nA rule for proportionality:\ny ∝ x   and   x∝y,  then   y∝z\nIn the graph, the straight line must pass through the origin, which means in formula y = kx + b , b has to be zero. Or the proportionality is incorrect.\nWe expect larger slope, k, and smaller initial displacement, b.\nModeling Using Geometric Similarity\nDefinition: Two or more objects have same shape but different size. This means corresponding angles are equal and corresponding distances are proportional.\nIf one object is geometric similar to another one, and the third object is geometric similar to the second one, it is always true that the first object is geometric similar to the third one. Different objects are scaled by some constant k.\nFor example, if rectangle ABCD is coresponding geometric similar to A&#039;B&#039;C&#039;D&#039;, the relation ship is:\n\\frac{AB}{A&#039;B&#039;} = \\frac{AC}{A&#039;C&#039;} = \\frac{AD}{A&#039;D&#039;} = \\frac{BC}{B&#039;C&#039;} =  \\frac{BD}{B&#039;D&#039;} = \\frac{CD}{C&#039;D&#039;} = k\nSimilarly, the ratio of their surface areas are S and S&#039; with relationship:\n\nLet’s say AB = l and A&#039;B&#039; = l&#039;, so \\frac{AB}{A&#039;B&#039;} = \\frac{l}{l&#039;} = k\nCombining the two equation,  $$\\frac{S}{S’} = k^2 = \\frac{l^2}{l’^2}\nTherefore, \n$$\\frac{S}{l^2} = \\frac{S&#039;}{l&#039;^2} = constant"},"Modeling-Contests/HiMCM--and--MidMCM":{"slug":"Modeling-Contests/HiMCM--and--MidMCM","filePath":"Modeling Contests/HiMCM & MidMCM.md","title":"HiMCM & MidMCM","links":[],"tags":[],"content":"COMAP’S High School Mathematical Contest in Modeling (HiMCM) and Middle Mathematical Contest in Modeling (MidMCM) are international contests designed to provide high school and middle school/level students with the opportunity to work as team members to engage and improve their modeling, problem solving, and writing skills. Contest problems are accessible using the mathematics taught at the respective levels of the contests.\nOfficial Website: www.comap.com/contests/himcm-midmcm\nTeam Members: Maximum four students currently enrolled in the same school\nPrevious Problems\n2024 HiMCM\n2024 HiMCM Problem A\n2024 HiMCM Problem B\n2024 MidMCM\n2024 MidMCM Problem C"},"Modeling-Contests/MCM--and--ICM":{"slug":"Modeling-Contests/MCM--and--ICM","filePath":"Modeling Contests/MCM & ICM.md","title":"MCM & ICM","links":[],"tags":[],"content":"COMAP’s Mathematical Contest in Modeling (MCM) and Interdisciplinary Contest in Modeling (ICM) are international contests for high school students and college undergraduates.\nOfficial Website: www.contest.comap.com/undergraduate/contests/\nTeam Members: Maximum three students currently enrolled in the same school\nPrevious Problems\n2025 MCM\n2025 MCM Problem A\n2025 MCM Problem B\n2025 ICM\n2025 ICM Problem D"},"Modeling-Methods/Experimental-Modeling":{"slug":"Modeling-Methods/Experimental-Modeling","filePath":"Modeling Methods/Experimental Modeling.md","title":"Experimental Modeling","links":[],"tags":[],"content":"One-Term Models\nA  One-Term Model  describle the quantity changes over time using a single mathmatical term or expression. These models follow differential equation of the form:\n\\frac{dx}{dt} = f(x)\nwhere x is the variable, t represents time, and \\frac{dx}{dt} is the rate of change.\nHigh-Order Polynomial Models\nIn some cases, models with more than one term will be considered, especially when a data set has asymptote(s). Thus, High-Order Polynomial models will be considered.\nIf there are N data points, the highest order that can perfectly fit all the data points is N - 1.\nAdvantages and Disadvantages of High-Order Polynomials\nHigh-Order Polynomials can approximate all data points, making future integral and derivative analyses more convenient.\nOn the other hand, consider a situation where data points form a positively sloped straight line, except for the last point, which is below the line. If a linear approximation is applied, the end of the line will continue to increase. However, if the high-order polynomial, such as quadrartic function, is used, the trend at the end may be decreasing."},"Modeling-Methods/Game-Theory":{"slug":"Modeling-Methods/Game-Theory","filePath":"Modeling Methods/Game Theory.md","title":"Game Theory","links":[],"tags":[],"content":"Outcome depends on only one player is called decision theory.\nOutcome depends on two or more players is called game theory.\nPure Strategy: A course of action avialable to player. The strategies chosen by each player lead to outcomes with payoffs for each player.\nDominate Strategy: If every outcome in A is same or better (at least one outcome is better) than the corresponding outcome in B.\nDominance Principle: A rational player will never choose a donimated strategy (a clearly inferior strategy) in a total conflict game.\nTotal conflict game: One player’s gain is exactly the other player’s lost.\nNash Equilibrium: Neither player can benefit by departing unilaterally from its strategy associated with that outcome.\nPure Strategy Nash Equilibrium:\nMixed Strategy: When a player does not always choose the same strategy, but depends on probability.\nPartial Conflict: Each possible outcome the payoffs to each player do not sum to the same constant.\nPrisoner’s Dilemma: A two-person partial conflict game in which each player has two strategies, defect or cooperate; defect dominates cooperate for both players even though the mutual defection outcome, which is the unique Nash equilibrium in the game, is worse for both players than the mutual cooperation outcome."},"Modeling-Methods/Modeling-Using-Graph-Theory":{"slug":"Modeling-Methods/Modeling-Using-Graph-Theory","filePath":"Modeling Methods/Modeling Using Graph Theory.md","title":"Modeling Using Graph Theory","links":[],"tags":[],"content":"The Seven Bridges of Königsberg\nThe Seven Bridges of Königsberg is a famous historical problem, posed in the city of Königsberg (now Kaliningrad, Russia). The city was set on both sides of the Pregel River (shown in the firgue) and included two large islands connected to each other and the mainland by seven bridges.\nThe problem is if it is posssible to walk through all the bridges exactly once, starting and ending at the same place.\nTransforming map in figure above into a graph, where every vertex (point) represents a land and every line represents a bridge.\n\nEuler’s Problem (restated)\nGiven a graph, under what conditions is it possible to find a closed walk that traverses every edge exactly once?\nGraphs for this kind of walk is possible is called Eulerian. The walk is called Eulerian path.\nConditions for an Eulerian Path:\n\nThe graph has to be connected.\nThe graph has even degree.\n\nThe vertex connects to odd number of lines has odd degree; the vertex connects to even number of lines has even degree.\nGraph Coloring\nFour-Color Problem\nGiven a geographic map, is it possible to color it with four colors so that any two regions that share a common border (of length greater than 0) are assigned different colors?\n\nThe graph above is a United States map with graph, where vertex represents each state and line between two vertices represents the states that share a common border.\nFour-Color Problem (restated)\nUsing only four colors, can you color the vertices of a graph drawn without edges crossing so that no vertex gets the same color as an adjacent vertex?\nProved with computer in 1977. Don’t have a mathamatical proof until now.\nApplications of Graph Coloring\nFinal exam scheduling problem is an application of graph coloring.\nThere are n courses and the purpose is to determine the minimize number of exam periods (without conflicts) used."},"Modeling-Methods/Modeling-with-Decision-Theory":{"slug":"Modeling-Methods/Modeling-with-Decision-Theory","filePath":"Modeling Methods/Modeling with Decision Theory.md","title":"Modeling with Decision Theory","links":[],"tags":[],"content":"Probability and Expected Value\n\\text{probability of an event = } \\frac {\\text{favorable outcomes}} {\\text{total outcomes}}\nWeighted Average\nThe formula of expected value is:\nE = w_1 p_1 + w_2 p_2 + \\cdots + w_n p_n\nor\nE = \\sum_{i=1}^{n} w_i p_i\nwhere w_i is the payoff of each outcome, p_i (0 \\leq p_i \\leq 1) is the corresponding probability. Note that weightes must sum to 1.\nSensitivity Analysis\nA typical decision model depends on many assumptions. We use sensitivity analysis to determine how the probabilities are likely to change.\nDecision Trees\n\nA terminal node with a consequence branchshowing the payoff for that outcome.\nSequential Decisions and Conditional Probabilities\nSequential Decision: Decision is made step by step, where each decision depends on the previous outcome.\nConditional Probability: The probability of one event when another event has already occurred."},"Modeling-Methods/Optimization-of-Discrete-Models":{"slug":"Modeling-Methods/Optimization-of-Discrete-Models","filePath":"Modeling Methods/Optimization of Discrete Models.md","title":"Optimization of Discrete Models","links":[],"tags":[],"content":"The basic model is:\n\\text{Optimize } f_j(\\mathbf{X}) \\quad \\text{for } j \\in J\n\\text{subject to } \\quad g_i(\\mathbf{X}) \n\\begin{cases}\n\\geq b_i \\\\\n= b_i \\\\\n\\leq b_i\n\\end{cases} \n\\quad \\text{for all } i \\in I\nIn the formula, to optimize means to maximize or minimize. The subscript j represents to the number of functions that are needed to optimize. J is a finite set, including integer subsctipts, j.\n\\mathbf{X}: Decision Variables."},"Modeling-Methods/Probabilistic-Modeling":{"slug":"Modeling-Methods/Probabilistic-Modeling","filePath":"Modeling Methods/Probabilistic Modeling.md","title":"Probabilistic Modeling","links":[],"tags":[],"content":"Probabilistic Modeling with Discrete\nMarkov Chain is a process with following characteristics:\n\nThere are the same finite number of states or outcomes that can be occupied at any given time.\nThe states do not overlap and cover all possible outcomes.\nNext state only depends on the present state, called memory lessness.\nThe sum of the probabilities for transitioning from the present state to the next state is equal to 1 for each state.\nFor example, here are two states, State 1 and State 2. If it is State 1 now, the probability of maintaining the present state is p, then the probability of changing from State 1 to State 2 is 1-p. The same applies to State 2. Notice p_1 does not necessary equal to p_2 .\n\n"},"Modeling-Methods/Simulation-Modeling":{"slug":"Modeling-Methods/Simulation-Modeling","filePath":"Modeling Methods/Simulation Modeling.md","title":"Simulation Modeling","links":[],"tags":[],"content":"Monte Carlo Simulation\nMonte Carlo Simulation is a type of probabilistic model.\nprobabilistic: Processes with randomness and uncertainty involved. Same input may have different output.\ndeterministic: Processes with no randomness and uncertainty involved. Same input always has same output.\nSimulating Deterministic Behavior: Area Under a Curve\nIn the graph, y = f(x), where 0 \\leq f(x) \\leq M and a \\leq x \\leq b . Now we select a random point P (x,y) in the rectangle. Create two counters, one to count the total points and the other to count the points in the region below the curve.\n\nThe formula to calculate the approximate value for the area below the curve is:\n\\text{area under curve} \\approx \\frac{\\text{number of points counted below curve}}{\\text{total number of random points}} \\: \\cdot \\ \\text{area of rectangle}\nThis method needs a large number of trails. In general, to cut the expected error in half, four times more experiments are needed.\nVolume Under a Surface\nThe method we use to approximate the volume is similar to the method we use to find the area under a curve.\nHere is the formula:\n\\text{volume of object to be measured} \\approx \\frac{\\text{number of points in the object to be measured}}{\\text{total number of points}} \\cdot \\ {\\text{total volume}}"},"Welcome-to-Mathematical-Modeling-Wiki":{"slug":"Welcome-to-Mathematical-Modeling-Wiki","filePath":"Welcome to Mathematical Modeling Wiki.md","title":"Welcome to Mathematical Modeling Wiki","links":["Concept/Model-Fitting","Concept/The-Modeling-Process,-Proportionality,-and-Geometric-Similarity","Concept/Modeling-Change","Modeling-Methods/Experimental-Modeling","Modeling-Methods/Simulation-Modeling","Modeling-Methods/Probabilistic-Modeling","Modeling-Methods/Optimization-of-Discrete-Models","Modeling-Methods/Modeling-Using-Graph-Theory","Modeling-Methods/Modeling-with-Decision-Theory","Modeling-Methods/Game-Theory","Modeling-Contests/MCM--and--ICM","Modeling-Contests/HiMCM--and--MidMCM","mailto:shi_yunqiu@hotmail.com"],"tags":[],"content":"---\ntitle: Welcome to Mathematical Modeling Wiki\n---\nContents\nConcept\nModel Fitting\nThe Modeling Process, Proportionality, and Geometric Similarity\nModeling Change\nModeling Methods\nExperimental Modeling\nSimulation Modeling\nProbabilistic Modeling\nOptimization of Discrete Models\nModeling Using Graph Theory\nModeling with Decision Theory\nGame Theory\nOutstanding Papers\nModeling Contests\nHigh school students and undergraduate students: MCM &amp; ICM\nMiddle school students and high school students: HiMCM &amp; MidMCM\nAuthor\nYunqiu Shi\nYunqiu (Rachel) is a high school student in Canada with a strong interest in mathematics, computer science, and creative problem solving. She is enthusiastic about using what she has learned to solve real-world problems, especially those that require both analytical thinking and innovative ideas. She believes that learning has the greatest impact when leading to meaningful action. Driven by a sense of social responsibility, Rachel hopes to create positive change and make meaningful contribution to the society. She approaches every challenge with a mix of logic and creativity, constantly looking for ways to connect her knowledge and real-world situations.\ncontact: shi_yunqiu@hotmail.com"},"index":{"slug":"index","filePath":"index.md","title":"index","links":["Concept/Model-Fitting","Concept/The-Modeling-Process,-Proportionality,-and-Geometric-Similarity","Concept/Modeling-Change","Modeling-Methods/Experimental-Modeling","Modeling-Methods/Simulation-Modeling","Modeling-Methods/Probabilistic-Modeling","Modeling-Methods/Optimization-of-Discrete-Models","Modeling-Methods/Modeling-Using-Graph-Theory","Modeling-Methods/Modeling-with-Decision-Theory","Modeling-Methods/Game-Theory","Modeling-Contests/MCM--and--ICM","Modeling-Contests/HiMCM--and--MidMCM","mailto:shi_yunqiu@hotmail.com"],"tags":[],"content":"---\ntitle: Welcome to Mathematical Modeling Wiki\n---\nContents\nConcept\nModel Fitting\nThe Modeling Process, Proportionality, and Geometric Similarity\nModeling Change\nModeling Methods\nExperimental Modeling\nSimulation Modeling\nProbabilistic Modeling\nOptimization of Discrete Models\nModeling Using Graph Theory\nModeling with Decision Theory\nGame Theory\nOutstanding Papers\nModeling Contests\nHigh school students and undergraduate students: MCM &amp; ICM\nMiddle school students and high school students: HiMCM &amp; MidMCM\nAuthor\nYunqiu Shi\nYunqiu (Rachel) is a high school student in Canada with a strong interest in mathematics, computer science, and creative problem solving. She is enthusiastic about using what she has learned to solve real-world problems, especially those that require both analytical thinking and innovative ideas. She believes that learning has the greatest impact when leading to meaningful action. Driven by a sense of social responsibility, Rachel hopes to create positive change and make meaningful contribution to the society. She approaches every challenge with a mix of logic and creativity, constantly looking for ways to connect her knowledge and real-world situations.\ncontact: shi_yunqiu@hotmail.com"}}